[
  {
    "District": 1,
    "Name": "Eric Blumhagen",
    "Photo": "eric_blumhagen",
    "Summary": "Eric is a father of two who works as a naval architect at Hockema Whalen Myers Associates. He has served on the PTA and PTO boards for Loyal Heights Elementary and Ingraham High School, and worked on the 2019 campaign to approve Seattle school levies. ",
    "Age": 43,
    "Website": "www.ericblumhagen.com",
    "Facebook ": "https://www.facebook.com/EricforSeattleSchools/",
    "Twitter": "DND",
    "Occupation": "Naval architect",
    "Neighborhood": "Loyal Heights",
    "Running": "I am running to improve accountability and to spread successful programs. The district needs to follow its policy and the law to provide students with an appropriate education. For example, many students have difficulty getting the district to approve special education services. We also need to identify successful programs and practices in our schools and replicate them in other schools so that all students benefit.",
    "Priority": "Replicate successful programs to close opportunity gaps, increase equity, and improve educational outcomes."
  },
  {
    "District": 1,
    "Name": "Michael J. Christophersen",
    "Photo": "michael_christophersen",
    "Summary": "Michael is a father of three who works as a technical consultant for HCL Technologies. He has been involved with district's special education PTSA. This is his second time running for School Board. He is married to Darcie Kline, another candidate for the District 1 seat. ",
    "Age": 58,
    "Website": "christophersen4schools.blogspot.com",
    "Facebook ": "DND",
    "Twitter": "DND",
    "Occupation": "Technical consultant ",
    "Neighborhood": "Broadview",
    "Running": "We need drastic changes to insure the district can hire and retain the best teachers plus maintain our schools without taxing people out of their homes or taking on massive debt. Cutting teachers and librarians or forgoing building maintenance is not the answer to a financial crisis. Once in office, I would conduct a review of all possible cost savings including elimination of central administrative positions and unnecessary expenditures. I would like to see an expansion of the Running Start program and more online learning options, especially for credit recovery.",
    "Priority": "Making sure our schools are properly funded without taxing people out of their homes and that the majority of funds reach the individual schools."
  },
  {
    "District": 1,
    "Name": "Darcie Kline",
    "Photo": "darcie_kline",
    "Summary": "Darcie is a mother of three who works as a ghost writer and special education advocate for students with specific learning disabilities. She is married to Michael J. Christophersen, who is also running for a District 1 seat.  ",
    "Age": 58,
    "Website": "DND",
    "Facebook ": "DND",
    "Twitter": "DND",
    "Occupation": "Ghost writer",
    "Neighborhood": "Broadview",
    "Running": "I am running because I am concerned about the quality of education in the school district. It is imperative for students to gain mastery in foundational subjects and develop critical thinking skills. My goal would be to assist in choosing research-based curriculum.",
    "Priority": "My priority if elected is to facilitate the adoption of researched-based curriculum."
  },
  {
    "District": 1,
    "Name": "Liza Rankin",
    "Photo": "eliza_rankin2",
    "Summary": "Liza is a mother of two students at Wedgewood Elementary School. She is an education advocate and school volunteer. ",
    "Age": 40,
    "Website": "elizasrankin.com",
    "Facebook ": "https://www.facebook.com/Liza-Rankin-for-Seattle-School-Board-Director-District-1-317173079179709/",
    "Twitter": "@lizarankin",
    "Occupation": "Education advocate",
    "Neighborhood": "Meadowbrook - Lake City",
    "Running": "I'm running to further my current work as a volunteer advocate in SPS. The district needs to be accountable for providing safe and welcoming environments for all kids, and needs to support the goals of the new Strategic Plan. I have the experience at all levels of advocacy and the community connections to be well-equipped to work from day one on improving our system for all kids.",
    "Priority": "My biggest priority is ensuring that all students have equitable access and opportunity, and can benefit from the best things our district has to offer in reaching their personal and academic goals."
  },
  {
    "District": 1,
    "Name": "Sanaz Saadat",
    "Photo": "sanaz_saadat",
    "Summary": "Sanaz is a doctoral student at the University of Washington School of Dentistry and serves on the executive board of the 46th Legislative District Democrats. She's worked and volunteered with K-12 and college students.",
    "Age": 42,
    "Website": "DND",
    "Facebook ": "DND",
    "Twitter": "DND",
    "Occupation": "PhD student ",
    "Neighborhood": "Olympic Hills - Lake City",
    "Running": "I have mentored undergraduate students through research opportunities, and have come in to the conclusion that our schools need to do a better job in preparing these valuable assets. I truly believe there is an inner gift hidden inside each and every student that can be uncovered through diverse curriculum, essential guidance, continuous encouragement and effective policies. No student, teacher or parent deserves to struggle or be stressed out during this learning process. I believe in creating a scientific and innovative approach to our school system through collaboration instead of competition specially that we are now in the center of a fast growing science and technology base city.",
    "Priority": "I will combine my diverse, scientific background with my passion for improving our schools to make sure every single member of our school system is covered under policies that will benefit them now and in future."
  },
  {
    "District": 2,
    "Name": "Lisa Rivera Smith",
    "Photo": "lisa_smith",
    "Summary": "Lisa is a mother of three and a former newspaper reporter and freelance writer. She serves on the PTSA board for Hamilton International Middle School and is a founding member of the Lincoln High School PTSA. ",
    "Age": 41,
    "Website": "www.LisaRiveraSmith.com",
    "Facebook ": "https://www.facebook.com/LisaRiveraSmithSPS/",
    "Occupation": "Stay-at-home mom ",
    "Neighborhood": "University District ",
    "Running": "Seattle students deserve the best, and yet time after time, funding falls short, voices are left out and inequities continue. Still, Seattle Public Schools has the potential to rise to the challenge and provide a great education for all of our city’s children. I am running because I’m a proven leader and problem solver who’s not afraid to face these challenges head on, seeking solutions from every corner. I will be a champion for the entire community, on the Seattle School Board.",
    "Priority": "My priority will be to follow through with our district’s promise to “place the interests of students above all others in every decision we make.” This should be the guiding principle behind everything we do, and I will work to make sure of it."
  },
  {
    "District": 3,
    "Name": "Chandra Hampson",
    "Photo": "chandra_hampson",
    "Summary": "Chandra is a mother of two students at Sand Point Elementary who works as a community and economic development consultant. She is the president of the Seattle Council PTSA.",
    "Age": 49,
    "Website": "electchandra.org",
    "Facebook ": "DND",
    "Twitter": "DND",
    "Occupation": "Consultant ",
    "Neighborhood": "Windermere",
    "Running": "From special education to funding for nurses and counselors, Seattle schools face serious challenges. As an education advocate and President of the Seattle Council PTSA, I've delivered results for our children without ever losing sight of the importance of social justice. As your School Board Member, I will bring my expertise in finance and budgeting to help our schools navigate their financial future. Together, we can build schools that prepare our students for success in an ever-expanding world.",
    "Priority": "From expanding the District’s cultural and linguistic programs to addressing racial and economic disparities in our Schools, I believe more equitable schools foster a stronger society."
  },
  {
    "District": 3,
    "Name": "Benjamin Leis",
    "Photo": "benjamin_leis",
    "Summary": "Benjamin is a father of two who works as a consulting software engineer for Dell/EMC. He's been involved with PTSAs, and volunteers in schools \"especially around math enrichment.\" ",
    "Age": 46,
    "Website": "benfortheboard.blogspot.com",
    "Facebook ": "@benfortheboard",
    "Twitter": "@benjamin_leis",
    "Occupation": "Software engineer",
    "Neighborhood": "Ravenna",
    "Running": "I've spent the last 8 become progressively more involved in the school. I'm there on a weekly basis either working with kids or engaging in school wide issues or advocating for district level policies.  This is a critical moment where I think my experience is best suited to navigating the current challenges (budget/equity/capacity/curriculum)",
    "Priority": "Provided a more consistent core quality experience at every building."
  },
  {
    "District": 3,
    "Name": "Rebeca Muñiz",
    "Photo": "rebeca_muniz",
    "Summary": "Rebeca is a former program coordinator for the Division of Public Behavioral Health and Justice Policy at the University of Washington, where she earned her master's in Education Policy and Leadership. While she was a student, she conducted research on the district's racial equity initiatives. ",
    "Age": 27,
    "Website": "www.electmuniz.com",
    "Facebook ": "https://www.facebook.com/electmuniz/",
    "Twitter": "https://twitter.com/harris4schools",
    "Occupation": "Education policy researcher ",
    "Neighborhood": "Roosevelt",
    "Running": "As a daughter of Mexican immigrants, I grew up watching my mother struggle to find work and resources for our family. I lived with instability while moving from school to school and did so with classmates that didn’t look like me or share my experiences. These experiences strengthened my resolve, and led me towards wanting to improve education policy and a graduate degree from the UW. Now I am committed to being a leader for our youth, and serving those who are struggling.",
    "Priority": "I want to implement policies that will establish racial equity."
  },
  {
    "District": 6,
    "Name": "Leslie Harris (incumbent)",
    "Photo": "leslie_harris",
    "Summary": "Leslie is a mother and foster parent who works as a litigation paralegal for Campiche Arnold PLLC. She is the Seattle School Board president. Before she was first elected to the District 6 seat in 2015, she worked on the Schools First campaign in support of district levies. ",
    "Age": 60,
    "Website": "www.Harrisforschoolboard.com",
    "Twitter": "@harris4schools",
    "Occupation": "Paralegal ",
    "Neighborhood": "Roxhill",
    "Running": "To continue the good work we have accomplished to do more: hired a new Superintendent; worked on and approved a new five-year strategic plan that focuses on equity and operations and targets closing the opportunity and achievement gaps; considerably increased transparency of the district's decisions; implemented new curriculum; increased professional development opportunities and pay for our staff and teachers; made high needs schools a priority of our BEX 5 Capital Budget Levy; signed a historic Memorandum of Understanding with the City of Seattle to work together for capital needs. My background prior to being on the Board as a parental advocate and 35 years as a litigation paralegal for victims and my last four years of service have given me a rare historical institutional knowledge for this position and the skills to bring change.",
    "Priority": "TBD "
  },
  {
    "District": 6,
    "Name": "Crystal S. Liston ",
    "Photo": "crystal_liston",
    "Summary": "Crystal is a parent whose goal is to volunteer in every Seattle school. So far, she's gotten to 15 of them.",
    "Age": 44,
    "Website": "www.crystalliston.com",
    "Facebook ": "DND",
    "Twitter": "DND",
    "Occupation": "Professional volunteer ",
    "Neighborhood": "Admiral",
    "Running": "I am running for a position on the Seattle School Board because I have a desire to connect our schools with each other and our local community. It has been my experience while volunteering in our schools that the different schools are very disconnected from each other. My goal is to volunteer in every school in our district to learn about the students, the neighborhoods they live in, what the buildings look like, is there a strong parent presence and if not, why? Where are the individual schools finding funding? Is there a grocery store nearby? Does the school have a community or not? I don't think this is information that is currently being addressed. I believe by volunteering in every school I am modeling how connection can look. How can a board member possibly govern a body of people they know nothing about?",
    "Priority": "To model how connection can look in our schools and to communicate to our entire population how the schools are doing and how each individual school needs our support."
  },
  {
    "District": 6,
    "Name": "Molly E. Mitchell",
    "Photo": "molly_mitchell",
    "Summary": "Molly is a mother of a Fairmount Park elementary school student who works as the director of student support programs at Seattle Central College. She hosts monthly parent equity meetings in West Seattle. ",
    "Age": 43,
    "Website": "DND",
    "Facebook ": "DND",
    "Twitter": "DND",
    "Occupation": "Program director ",
    "Neighborhood": "High Point ",
    "Running": "I’m running because I believe in our students, our teachers and our families. I believe we can work together to create a more equitable school system and as an educator for over 20 years that has centered equity I believe I can add voice to the board that assists to advance policies and procedures that can improve outcomes for all students.",
    "Priority": "My biggest priority is addressing the opportunity gap and equitable funding."
  }
]